##Q1:
Read Data
We can read data in pandas data frame as read_csv(). Two most used data read formats are csv and excel. If we are reading data in excel format, we can also give sheet names as follows. There are other less used options of other file types too.


Image by Author
2. Head and Tail

To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. In contrast to see below rows, we can use df.tail().


Image by Author
3. Shape, Size and Info

Two most basic functions after reading data is to know the number of rows and columns, and to know the datatype of variables. We can use df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame. We can also use df.info(), from that we get different information such as rows from RangeIndex, Data columns and then data type of each column. It also includes the information of non-null counts.


4. isna

But, if one needs to get the total number of null values in a data, we can use df.isna() as below. Sum will give the total null values. If we want just one variable null values, we can also get it by giving the name of the variable as below.


Image by Author
5. Describe

Then to understand basic statistics of variables we can use df.describe(). It will give you count, mean, standard deviation, and also 5 number summary.


Image by Author
6. Nunique

To get the total unique values of variables, we can use df.nunique(). It will give all the unique values a variable contains.


Image by Author

In [1]:
import pandas as pd

In [6]:
data = [[1,2,3], [3,4,5],[7,8,6]]
df = pd.DataFrame(data, columns = ["A", 'B', 'C'])

In [7]:
df

   A  B  C
0  1  2  3
1  3  4  5
2  7  8  6

In [10]:
df1 = df.reindex([1,3,5])

In [11]:
df1

     A    B    C
1  3.0  4.0  5.0
3  NaN  NaN  NaN
5  NaN  NaN  NaN

In [12]:
##Q3:

import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data, columns = ["Values"])

In [13]:
df

   Values
0       1
1       2
2       3
3       4
4       5

In [23]:
for i in df.iterrows():
    print(i)

(0, Values    1
Name: 0, dtype: int64)
(1, Values    2
Name: 1, dtype: int64)
(2, Values    3
Name: 2, dtype: int64)
(3, Values    4
Name: 3, dtype: int64)
(4, Values    5
Name: 4, dtype: int64)

In [26]:
list[df['Values']]

list[0    1
1    2
2    3
3    4
4    5
Name: Values, dtype: int64]

In [30]:
def test(x):
    return x.sum()
df.apply(test)

Values    15
dtype: int64

In [35]:
df2 = df[['Values']][0:3]

In [36]:
df2

   Values
0       1
1       2
2       3

In [37]:
def test(x):
    return x.sum()
df2.apply(test)

Values    6
dtype: int64

In [131]:
##Q4:

import pandas as pd
data = ["sudh singh", "rishi singh"]
df1 = pd.DataFrame(data, columns = ["Text"])

In [132]:
df1

          Text
0   sudh singh
1  rishi singh

In [ ]:
df1['word_count'] = df1['Text'].apply(lambda x: len(x.split()))

How are DataFrame.size() and DataFrame.shape() different?
Pandas DataFrame size()
The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

Pandas DataFrame shape()
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Which function of pandas do we use to read an excel file?

Pandas read_excel() function
Pandas read_excel() function is used for reading the excel files. Files can be imported using a URL link or can be directly imported from the disk. There are different parameters like io for path,sheet_name for specifying the name of the sheet, etc. for reading the file.16-Nov-2022

In [58]:
import pandas as pd
data = ["sudh@gmail.com", "rishi@gamil.com"]
df = pd.DataFrame(data, columns = ["Email"])

In [59]:
df

             Email
0   sudh@gmail.com
1  rishi@gamil.com

In [62]:
df['username']= df['Email'].apply(lambda x: x.split('@')[0])

In [63]:
df

             Email username
0   sudh@gmail.com     sudh
1  rishi@gamil.com    rishi

In [70]:

import pandas as pd
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30},
       {'a': 34, 'b': 56, 'c': 3}]
df= pd.DataFrame(data)

In [71]:
df

    a   b   c
0   1   2   3
1  10  20  30
2  34  56   3

In [97]:
df1  =df[df.a>5]
df2 = df[df.b<10]

In [98]:
df1

    a   b   c
1  10  20  30
2  34  56   3

In [99]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data, columns = ["Values"])

In [100]:
df

   Values
0       1
1       2
2       3
3       4
4       5

In [101]:
df.mean()

Values    3.0
dtype: float64

In [102]:
df.median()

Values    3.0
dtype: float64

In [103]:
df.std()

Values    1.581139
dtype: float64

In [104]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.random((200,3)))
df['date'] = pd.date_range('2023-1-23', periods=200, freq='D')
mask = (df['date'] > '2000-6-1') & (df['date'] <= '2023-1-31')
print(df.loc[mask])

          0         1         2       date
0  0.788951  0.151476  0.778263 2023-01-23
1  0.791232  0.308316  0.740383 2023-01-24
2  0.096680  0.050685  0.705217 2023-01-25
3  0.461843  0.174014  0.619193 2023-01-26
4  0.951844  0.071086  0.569810 2023-01-27
5  0.854445  0.751322  0.106954 2023-01-28
6  0.819236  0.183132  0.866778 2023-01-29
7  0.698102  0.004313  0.359748 2023-01-30
8  0.373647  0.801129  0.061312 2023-01-31

In [106]:
##Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

import pandas as pd

Object `imported` not found.

In [107]:
import pandas as pd
data = ['2023-01-01', '2023-01-02', '2023-01-02', '2023-01-02']
df = pd.DataFrame(data, columns = ["date"])

In [108]:
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-02
3  2023-01-02

In [110]:
df['weekend']=['Sunday', 'monday','tuesday','wednesday']

In [111]:
df

         date    weekend
0  2023-01-01     Sunday
1  2023-01-02     monday
2  2023-01-02    tuesday
3  2023-01-02  wednesday